; ModuleID = 'blah.7rcbfp3g-cgu.0'
source_filename = "blah.7rcbfp3g-cgu.0"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Formatter" = type { [0 x i64], { i64, i64 }, [0 x i64], { i64, i64 }, [0 x i64], { {}*, [3 x i64]* }, [0 x i64], { i64*, i64* }, [0 x i64], { [0 x { i8*, i8* }]*, i64 }, [0 x i32], i32, [0 x i32], i32, [0 x i8], i8, [7 x i8] }
%"core::fmt::Void" = type { [0 x i8], {}, [0 x i8], %"core::marker::PhantomData<*mut core::ops::function::Fn<(), Output=()>>", [0 x i8] }
%"core::marker::PhantomData<*mut core::ops::function::Fn<(), Output=()>>" = type {}
%"core::fmt::Arguments" = type { [0 x i64], { [0 x { [0 x i8]*, i64 }]*, i64 }, [0 x i64], { i64*, i64 }, [0 x i64], { [0 x { i8*, i8* }]*, i64 }, [0 x i64] }
%"core::panic::Location" = type { [0 x i64], { [0 x i8]*, i64 }, [0 x i32], i32, [0 x i32], i32, [0 x i32] }
%"unwind::libunwind::_Unwind_Exception" = type { [0 x i64], i64, [0 x i64], void (i32, %"unwind::libunwind::_Unwind_Exception"*)*, [0 x i64], [6 x i64], [0 x i64] }
%"unwind::libunwind::_Unwind_Context" = type { [0 x i8] }


!36 = !DIEnumerator(name: "Unknown", value: 3)
!37 = !{!0}
!38 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h61e5f11fc43499b0E", scope: !7, file: !39, line: 62, type: !40, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !45, retainedNodes: !4)
!39 = !DIFile(filename: "/rustc/710a362dc7634fce42885327b6b7b1b3a9b0c41a/src/libstd/rt.rs", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !11, !42, !43}
!42 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !24, size: 64, align: 64)
!45 = !{!46}
!46 = !DITemplateTypeParameter(name: "T", type: !47)
!47 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!48 = !DILocalVariable(name: "main", arg: 1, scope: !38, file: !39, line: 63, type: !11)
!49 = !DILocation(line: 63, column: 4, scope: !38)
!50 = !DILocalVariable(name: "argc", arg: 2, scope: !38, file: !39, line: 64, type: !42)
!51 = !DILocation(line: 64, column: 4, scope: !38)
!52 = !DILocalVariable(name: "argv", arg: 3, scope: !38, file: !39, line: 65, type: !43)
!53 = !DILocation(line: 65, column: 4, scope: !38)
!54 = !DILocation(line: 67, column: 25, scope: !38)
!55 = !DILocation(line: 67, column: 24, scope: !38)
!56 = !DILocation(line: 67, column: 50, scope: !38)
!57 = !DILocation(line: 67, column: 56, scope: !38)
!58 = !DILocation(line: 67, column: 4, scope: !38)
!59 = !DILocation(line: 68, column: 1, scope: !38)
!60 = distinct !DISubprogram(name: "{{closure}}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hb0ba6925efc6e00bE", scope: !6, file: !39, line: 67, type: !61, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !45, retainedNodes: !4)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64}
!63 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&closure-0", baseType: !5, size: 64, align: 64)
!65 = !DILocalVariable(name: "main", scope: !60, file: !39, line: 63, type: !11, align: 8)
!66 = !DILocation(line: 63, column: 4, scope: !60)
!67 = !DILocation(line: 67, column: 33, scope: !60)
!68 = !DILocation(line: 67, column: 48, scope: !60)
!69 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h3797b8e2140a9282E", scope: !71, file: !70, line: 394, type: !78, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !4, retainedNodes: !4)
!70 = !DIFile(filename: "/rustc/710a362dc7634fce42885327b6b7b1b3a9b0c41a/src/libstd/sys/unix/process/process_common.rs", directory: "")
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !72, file: !2, size: 8, align: 8, elements: !76, templateParams: !4, identifier: "eb7ec4d9e2407bd2e6555cd4631834b8")
!72 = !DINamespace(name: "process_common", scope: !73)
!73 = !DINamespace(name: "process", scope: !74)
!74 = !DINamespace(name: "unix", scope: !75)
!75 = !DINamespace(name: "sys", scope: !8)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !71, file: !2, baseType: !24, size: 8, align: 8)
!78 = !DISubroutineType(types: !79)
!79 = !{!63, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !71, size: 64, align: 64)
!81 = !DILocalVariable(name: "self", arg: 1, scope: !69, file: !70, line: 394, type: !80)
!82 = !DILocation(line: 394, column: 18, scope: !69)
!83 = !DILocation(line: 395, column: 8, scope: !69)
!84 = !DILocation(line: 396, column: 5, scope: !69)
!85 = distinct !DISubprogram(name: "new<i64>", linkageName: "_ZN4core3fmt10ArgumentV13new17ha49368782a0d00daE", scope: !87, file: !86, line: 277, type: !164, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !171, retainedNodes: !4)
!86 = !DIFile(filename: "/rustc/710a362dc7634fce42885327b6b7b1b3a9b0c41a/src/libcore/fmt/mod.rs", directory: "")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !31, file: !2, size: 128, align: 64, elements: !88, templateParams: !4, identifier: "30f27d84ed4e8741128c6fa9dd1242f1")
!88 = !{!89, !111}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !87, file: !2, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Void", baseType: !91, size: 64, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Void", scope: !31, file: !2, align: 8, elements: !92, templateParams: !4, identifier: "6630c46b3fec792767d66b3af5c6c36")
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_priv", scope: !91, file: !2, baseType: !47, align: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_oibit_remover", scope: !91, file: !2, baseType: !95, align: 8)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<*mut Fn<()>>", scope: !96, file: !2, align: 8, elements: !4, templateParams: !97, identifier: "4faba36c2dc6f961f662a987c3d873dc")
!96 = !DINamespace(name: "marker", scope: !23)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "T", type: !99)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut Fn<()>", scope: !100, file: !2, size: 128, align: 64, elements: !102, templateParams: !4, identifier: "905283b85104cb8c701de49d970ff6c5")
!100 = !DINamespace(name: "function", scope: !101)
!101 = !DINamespace(name: "ops", scope: !23)
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !99, file: !2, baseType: !104, size: 64, align: 64, flags: DIFlagArtificial)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !24, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !99, file: !2, baseType: !106, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !107, size: 64, align: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 192, align: 64, elements: !109)
!108 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!109 = !{!110}
!110 = !DISubrange(count: 3)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !87, file: !2, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::Void, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!21, !90, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !116, size: 64, align: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !31, file: !2, size: 768, align: 64, elements: !117, templateParams: !4, identifier: "702f07f680b393ff3e48856915bd1cce")
!117 = !{!118, !120, !122, !123, !139, !140, !145, !159}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !116, file: !2, baseType: !119, size: 32, align: 32, offset: 640)
!119 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !116, file: !2, baseType: !121, size: 32, align: 32, offset: 672)
!121 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !116, file: !2, baseType: !28, size: 8, align: 8, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !116, file: !2, baseType: !124, size: 128, align: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !125, file: !2, size: 128, align: 64, elements: !126, identifier: "68c51caaa617cdd4dce277a82d981917")
!125 = !DINamespace(name: "option", scope: !23)
!126 = !{!127}
!127 = !DICompositeType(tag: DW_TAG_variant_part, scope: !125, file: !2, size: 128, align: 64, elements: !128, templateParams: !131, identifier: "68c51caaa617cdd4dce277a82d981917_variant_part", discriminator: !137)
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !127, file: !2, baseType: !130, size: 128, align: 64, extraData: i64 0)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !124, file: !2, size: 128, align: 64, elements: !4, templateParams: !131, identifier: "68c51caaa617cdd4dce277a82d981917::None")
!131 = !{!132}
!132 = !DITemplateTypeParameter(name: "T", type: !108)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !127, file: !2, baseType: !134, size: 128, align: 64, extraData: i64 1)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !124, file: !2, size: 128, align: 64, elements: !135, templateParams: !131, identifier: "68c51caaa617cdd4dce277a82d981917::Some")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, scope: !125, file: !2, baseType: !138, size: 64, align: 64, flags: DIFlagArtificial)
!138 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !116, file: !2, baseType: !124, size: 128, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !116, file: !2, baseType: !141, size: 128, align: 64, offset: 256)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !31, file: !2, size: 128, align: 64, elements: !142, templateParams: !4, identifier: "633445aa2e9f63a879758e1303ea587b")
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !141, file: !2, baseType: !104, size: 64, align: 64, flags: DIFlagArtificial)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !141, file: !2, baseType: !106, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "curarg", scope: !116, file: !2, baseType: !146, size: 128, align: 64, offset: 384)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<core::fmt::ArgumentV1>", scope: !147, file: !2, size: 128, align: 64, elements: !148, templateParams: !157, identifier: "cdd17eb1c239a5a429b77ab900532626")
!147 = !DINamespace(name: "slice", scope: !23)
!148 = !{!149, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !146, file: !2, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::ArgumentV1", baseType: !87, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !146, file: !2, baseType: !150, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !146, file: !2, baseType: !153, align: 8)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&core::fmt::ArgumentV1>", scope: !96, file: !2, align: 8, elements: !4, templateParams: !154, identifier: "8915a1eea12fad6d4e5307b0cf713f9")
!154 = !{!155}
!155 = !DITemplateTypeParameter(name: "T", type: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::ArgumentV1", baseType: !87, size: 64, align: 64)
!157 = !{!158}
!158 = !DITemplateTypeParameter(name: "T", type: !87)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !116, file: !2, baseType: !160, size: 128, align: 64, offset: 512)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !2, size: 128, align: 64, elements: !161, templateParams: !4, identifier: "9790dc71950a303ba2998bc4918672bb")
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !160, file: !2, baseType: !150, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !160, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!87, !166, !168}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i64", baseType: !167, size: 64, align: 64)
!167 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&i64, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!21, !166, !115}
!171 = !{!172}
!172 = !DITemplateTypeParameter(name: "T", type: !167)
!173 = !DILocalVariable(name: "x", arg: 1, scope: !85, file: !86, line: 277, type: !166)
!174 = !DILocation(line: 277, column: 22, scope: !85)
!175 = !DILocalVariable(name: "f", arg: 2, scope: !85, file: !86, line: 277, type: !168)
!176 = !DILocation(line: 277, column: 32, scope: !85)
!177 = !DILocation(line: 278, column: 56, scope: !178)
!178 = distinct !DILexicalBlock(scope: !85, file: !86, line: 278, column: 8)
!179 = !DILocation(line: 278, column: 41, scope: !178)
!180 = !DILocation(line: 278, column: 82, scope: !178)
!181 = !DILocation(line: 278, column: 67, scope: !178)
!182 = !DILocation(line: 278, column: 17, scope: !178)
!183 = !DILocation(line: 279, column: 5, scope: !85)
!184 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h3b68aedbd02220b7E", scope: !185, file: !86, line: 313, type: !254, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !4, retainedNodes: !4)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !31, file: !2, size: 384, align: 64, elements: !186, templateParams: !4, identifier: "62b5d8eb78fda96043aa097b59c28f6d")
!186 = !{!187, !197, !253}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !185, file: !2, baseType: !188, size: 128, align: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !189, templateParams: !4, identifier: "6dc4ddb2dbcf2912a5f3983b5bf0572")
!189 = !{!190, !196}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !188, file: !2, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !192, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !193, templateParams: !4, identifier: "111094d970b097647de579f9c509ef08")
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !192, file: !2, baseType: !44, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !192, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !188, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !185, file: !2, baseType: !198, size: 128, align: 64, offset: 128)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !125, file: !2, size: 128, align: 64, elements: !199, identifier: "cc58646369874ea8976a7da4e6ac462e")
!199 = !{!200}
!200 = !DICompositeType(tag: DW_TAG_variant_part, scope: !125, file: !2, size: 128, align: 64, elements: !201, templateParams: !204, identifier: "cc58646369874ea8976a7da4e6ac462e_variant_part", discriminator: !137)
!201 = !{!202, !249}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !200, file: !2, baseType: !203, size: 128, align: 64, extraData: i64 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !198, file: !2, size: 128, align: 64, elements: !4, templateParams: !204, identifier: "cc58646369874ea8976a7da4e6ac462e::None")
!204 = !{!205}
!205 = !DITemplateTypeParameter(name: "T", type: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !2, size: 128, align: 64, elements: !207, templateParams: !4, identifier: "99ddfb434e974aef983609074c6efdaa")
!207 = !{!208, !248}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !206, file: !2, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::rt::v1::Argument", baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !29, file: !2, size: 512, align: 64, elements: !211, templateParams: !4, identifier: "3db4fb4f550c1b86f8f983ee16732dba")
!211 = !{!212, !224}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !210, file: !2, baseType: !213, size: 128, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Position", scope: !29, file: !2, size: 128, align: 64, elements: !214, identifier: "ea7670f9093da8a737b19625f0cf26f1")
!214 = !{!215}
!215 = !DICompositeType(tag: DW_TAG_variant_part, scope: !29, file: !2, size: 128, align: 64, elements: !216, templateParams: !4, identifier: "ea7670f9093da8a737b19625f0cf26f1_variant_part", discriminator: !223)
!216 = !{!217, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !215, file: !2, baseType: !218, size: 128, align: 64, extraData: i64 0)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Next", scope: !213, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "ea7670f9093da8a737b19625f0cf26f1::Next")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "At", scope: !215, file: !2, baseType: !220, size: 128, align: 64, extraData: i64 1)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "At", scope: !213, file: !2, size: 128, align: 64, elements: !221, templateParams: !4, identifier: "ea7670f9093da8a737b19625f0cf26f1::At")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !220, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, scope: !29, file: !2, baseType: !138, size: 64, align: 64, flags: DIFlagArtificial)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !210, file: !2, baseType: !225, size: 384, align: 64, offset: 128)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !29, file: !2, size: 384, align: 64, elements: !226, templateParams: !4, identifier: "cd7ba9e4240b907a6af49f5b9d60d5f0")
!226 = !{!227, !228, !229, !230, !247}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !225, file: !2, baseType: !121, size: 32, align: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !225, file: !2, baseType: !28, size: 8, align: 8, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !2, baseType: !119, size: 32, align: 32, offset: 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !225, file: !2, baseType: !231, size: 128, align: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !29, file: !2, size: 128, align: 64, elements: !232, identifier: "8e7b0c6ac2efa609782064513ed404a")
!232 = !{!233}
!233 = !DICompositeType(tag: DW_TAG_variant_part, scope: !29, file: !2, size: 128, align: 64, elements: !234, templateParams: !4, identifier: "8e7b0c6ac2efa609782064513ed404a_variant_part", discriminator: !223)
!234 = !{!235, !239, !243, !245}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !233, file: !2, baseType: !236, size: 128, align: 64, extraData: i64 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !231, file: !2, size: 128, align: 64, elements: !237, templateParams: !4, identifier: "8e7b0c6ac2efa609782064513ed404a::Is")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !236, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !233, file: !2, baseType: !240, size: 128, align: 64, extraData: i64 1)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !231, file: !2, size: 128, align: 64, elements: !241, templateParams: !4, identifier: "8e7b0c6ac2efa609782064513ed404a::Param")
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !240, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "NextParam", scope: !233, file: !2, baseType: !244, size: 128, align: 64, extraData: i64 2)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "NextParam", scope: !231, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "8e7b0c6ac2efa609782064513ed404a::NextParam")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !233, file: !2, baseType: !246, size: 128, align: 64, extraData: i64 3)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !231, file: !2, size: 128, align: 64, elements: !4, templateParams: !4, identifier: "8e7b0c6ac2efa609782064513ed404a::Implied")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !225, file: !2, baseType: !231, size: 128, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !206, file: !2, baseType: !108, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !200, file: !2, baseType: !250, size: 128, align: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !198, file: !2, size: 128, align: 64, elements: !251, templateParams: !204, identifier: "cc58646369874ea8976a7da4e6ac462e::Some")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !250, file: !2, baseType: !206, size: 128, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !185, file: !2, baseType: !160, size: 128, align: 64, offset: 256)
!254 = !DISubroutineType(types: !255)
!255 = !{!185, !188, !160}
!256 = !DILocalVariable(name: "pieces", arg: 1, scope: !184, file: !86, line: 313, type: !188)
!257 = !DILocation(line: 313, column: 18, scope: !184)
!258 = !DILocalVariable(name: "args", arg: 2, scope: !184, file: !86, line: 313, type: !160)
!259 = !DILocation(line: 313, column: 41, scope: !184)
!260 = !DILocation(line: 314, column: 20, scope: !184)
!261 = !DILocation(line: 314, column: 33, scope: !184)
!262 = !DILocation(line: 314, column: 39, scope: !184)
!263 = !DILocation(line: 314, column: 8, scope: !184)
!264 = !DILocation(line: 315, column: 5, scope: !184)
!265 = distinct !DISubprogram(name: "call_once<closure-0,()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h85328a11400f02b0E", scope: !267, file: !266, line: 232, type: !268, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !271, retainedNodes: !4)
!266 = !DIFile(filename: "/rustc/710a362dc7634fce42885327b6b7b1b3a9b0c41a/src/libcore/ops/function.rs", directory: "")
!267 = !DINamespace(name: "FnOnce", scope: !100)
!268 = !DISubroutineType(types: !269)
!269 = !{!63, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut closure-0", baseType: !5, size: 64, align: 64)
!271 = !{!272, !273}
!272 = !DITemplateTypeParameter(name: "Self", type: !5)
!273 = !DITemplateTypeParameter(name: "Args", type: !47)
!274 = !DILocalVariable(arg: 1, scope: !265, file: !266, line: 232, type: !270)
!275 = !DILocation(line: 232, column: 4, scope: !265)
!276 = !DILocalVariable(arg: 2, scope: !265, file: !266, line: 232, type: !47)
!277 = distinct !DISubprogram(name: "call_once<closure-0,()>", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h1c6a3bdd323dafbcE", scope: !267, file: !266, line: 232, type: !278, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !271, retainedNodes: !4)
!278 = !DISubroutineType(types: !279)
!279 = !{!63, !5}
!280 = !DILocalVariable(arg: 1, scope: !277, file: !266, line: 232, type: !5)
!281 = !DILocation(line: 232, column: 4, scope: !277)
!282 = !DILocalVariable(arg: 2, scope: !277, file: !266, line: 232, type: !47)
!283 = distinct !DISubprogram(name: "real_drop_in_place<closure-0>", linkageName: "_ZN4core3ptr18real_drop_in_place17h66f60b5da6e8a5fbE", scope: !285, file: !284, line: 181, type: !286, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !289, retainedNodes: !4)
!284 = !DIFile(filename: "/rustc/710a362dc7634fce42885327b6b7b1b3a9b0c41a/src/libcore/ptr/mod.rs", directory: "")
!285 = !DINamespace(name: "ptr", scope: !23)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut closure-0", baseType: !5, size: 64, align: 64)
!289 = !{!290}
!290 = !DITemplateTypeParameter(name: "T", type: !5)
!291 = !DILocalVariable(arg: 1, scope: !283, file: !284, line: 181, type: !288)
!292 = !DILocation(line: 181, scope: !283)
!293 = distinct !DISubprogram(name: "report", linkageName: "_ZN54_$LT$$LP$$RP$$u20$as$u20$std..process..Termination$GT$6report17ha6b420331382674fE", scope: !295, file: !294, line: 1653, type: !297, scopeLine: 1653, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !18, templateParams: !4, retainedNodes: !4)
!294 = !DIFile(filename: "/rustc/710a362dc7634fce42885327b6b7b1b3a9b0c41a/src/libstd/process.rs", directory: "")
!295 = !DINamespace(name: "{{impl}}", scope: !296)
!296 = !DINamespace(name: "process", scope: !8)
!297 = !DISubroutineType(types: !298)
!298 = !{!63, !47}
!299 = !DILocalVariable(name: "self", arg: 1, scope: !293, file: !294, line: 1653, type: !47)
!300 = !DILocation(line: 1653, column: 14, scope: !293)
